about = """
Я начинающий разработчик.
Привет, я Ару! Мне 14, и я увлекаюсь программированием.
Для меня код - это способ превратить простые задумки в реальные проекты. Но что бы узнать ещё больше об о мне и о моих работах, переходите к моему ИИ ассистенту. Он ответит на любые ваши вопросы.
"""


goal = """
Мой путь в IT начался с моей огромной любви к играм. Я обожаю играть, проходить разные сюжеты и смотреть, как играют другие блогеры. В какой-то момент мне стало безумно любопытно: а как это все устроено изнутри? Как обычные строчки на экране превращаются в персонажей, которые двигаются и слушаются игрока? Именно это любопытство и привело меня в программирование.
Сейчас я только в начале своего пути и пока не знаю свою главную, финальную цель в IT. И это здорово! Моя цель на сегодня — пробовать новое, учиться создавать умных ботов, запускать свои первые симуляции на Python и смотреть, на что я способна. Я просто перевожу свой интерес к играм в полезный навык и ищу то, что зажжет меня сильнее всего.
"""


story = """
Всё началось с моего интереса к просмотру прохождений игр блогеров на YouTube. Мне стало просто любопытно: как устроены игры изнутри и как создаются персонажи, которые выполняют команды игрока?
Чтобы разобраться в этом, я пошла учиться в школу Cap Education и стала изучать язык Python. Он понравился мне тем, что на нём можно быстро увидеть результат своей работы. В школе я перешла от теории к практике и написала свои первые программы. Этот опыт вдохновил меня собрать все свои работы в одном месте. Так и появилась эта платформа-портфолио Nova Space — мой личный космос, где я показываю свои навыки и симуляции.
"""


mentor = """
Мой ментор помогает мне развиваться в IT.Мой ментор — Сара Ұлан. Она учит меня писать код правильно, аккуратно и красиво, чтобы он был понятен не только компьютеру, но и другим людям.
Главное, чему научила меня Сара — это умение читать свой собственный код. Она всегда говорила: чтобы научиться писать хорошо и понимать чужие программы, нужно сначала научиться перечитывать и до конца понимать то, что написала ты сама. Сара всегда была на связи: она помогала нам с ребятами и понятно объясняла сложные моменты, когда мы задавали любые вопросы о коде. А еще наши занятия никогда не были скучными: Сара постоянно проводила для нас игры на платформе Kahoot, чтобы мы легко и с азартом закрепляли новые знания.
"""


progress = """
Придя в школу, я совсем не знала, что такое программирование. Для меня это был абсолютно новый мир. Я не понимала даже самых базовых вещей — например, что такое переменные в коде и как они работают.
На сегодняшний день мои навыки понимания кода сильно выросли.Я умею самостоятельно разрабатывать умных Telegram-ботов и интерактивные симуляции на Python.Кроме того, я научилась создавать мини-игры на библиотеке Pygame. Например, я могу с нуля воссоздать знаменитую игру про Динозаврика или Пинг-понг, улучшить их, добавить свои собственные саундтреки и звуковые эффекты. Сейчас код для меня — это понятный инструмент, с помощью которого я могу делать свои проекты интерактивными и живыми.
"""


hobbies = """
В свободное время когда я закрываю ноутбук с кодом, я переключаюсь на спорт, музыку и творчество:
🎧Я хожу на тренировки по волейболу, а также окончила музыкальную школу по классу фортепиано, отучившись там 7 лет.
📱Мне очень нравится монтировать видео и создавать эдиты в приложении Alight Motion. Благодаря этому навыку я часто помогаю маме и учителям в школе, когда нужно смонтировать ролик или настроить что-то в телефоне — они знают, что ко мне всегда можно обратиться.
📚Люблю читать (сейчас это детектив Агаты Кристи «Убийство в Восточном экспрессе») и мангу, например «Огненный удар». Смотрю много аниме, а среди самых любимых — «Блич», «Пожиратель душ» и «Адский рай».
🎮 Я обожаю видеоигры. Мы часто собираемся с друзьями, чтобы повеселиться в Brawl Stars, Roblox, Among Us или Gartic Phone. А для души я прохожу масштабные игры с крутым сюжетом и атмосферой — Genshin Impact, Honkai: Star Rail и Zenless Zone Zero.
"""


works = [
    "💻 Мои лучшие работы:"
        "💡 Программа 'Камень-Ножницы-Бумага', в которой пользователь играет против компьютера. Программа подсчитывает очки и определяет победителя каждого раунда. \n"
        "\n"
        "🏧 Симуляция 'Банкомата', это интерактивная программа с текстовым интерфейсом который позволяет пользователям выбирать действия и взаимодействовать с банкоматом. \n"
        "\n"
        "📚 Консольная программа 'Образовательное Приложение' которая помогает пользователям изучать новые темы с помощью карточек с вопросами и ответами, викторины и заметок.\n"
        "\n"
        "🏓 Полноценная 2D игра 'Пинг-Понг' на Python с использованием библиотеки Pygame. Проект представляет собой классическую аркаду для двух игроков. \n"
        "\n"
        "🎮Популярный 2D-раннер 'Dino'. Логика игры  построена на непрерывном движении игрового мира. Игра включает в себя процедурную генерацию препятствий разных характеристик и прогрессивно растущую сложность.  \n"
        "\n"
        "💸 'Currency Bot - это телеграм-бот для мониторинга конвертации валют в реальном времени. Он позволяет пользователям переводить суммы из одной валюты в другую, а также получать актуальные курсы обмена. Проект разработан с помощью библиотек для роботы с API Telegram и внешними финансовыми сервисами.' \n"
        "\n"
        "🤖 Телеграм-бот ассистент на базе искусственного интеллекта - 'Knowledge AI bot'. Этот бот представляет собой умного помощника,который может адаптироваться от решения сложных задач и структурированного обучения до ведения свободного диалога."
]


github = "Все мои проекты можно увидеть в моем профиле: https://github.com/searku"